---
layout: post
title: Anneaux, corps, polynÃ´mes, expressions
---

## Structures prÃ©dÃ©finies

Sage prÃ©dÃ©finit pour l'utilisateur certaines structures algÃ¨briques de
base, les noms s'expliquent tous seulsÂ :

~~~
sage: NN
Non negative integer semiring
sage: ZZ
Integer Ring
sage: QQ
Rational Field
sage: QQbar
Algebraic Field
sage: RR
Real Field with 53 bits of precision
sage: RDF
Real Double Field
sage: CC
Complex Field with 53 bits of precision
sage: GF(7)
Finite Field of size 7
sage: Zmod(15)
Ring of integers modulo 15
sage: Zmod(7)
Ring of integers modulo 7
sage: Qp(5)
5-adic Field with capped relative precision 20
~~~

## Variables et expressions symboliques

Voir le [Sagebook]({{ site.data.bib.sagebook }}), Section 1.2.

Sage peut utiliser toute la syntaxe du langage Python, Ã  partir de la
possibilitÃ© de dÃ©finir des variablesÂ :

~~~
sage: a = 2+2
sage: a
4
sage: a+2
6
~~~

Une variable spÃ©ciale, `_` (tiret bas), permet de faire rÃ©fÃ©rence Ã  la
derniÃ¨re valeur affichÃ©eÂ :

~~~
sage: _
6
~~~

Cette variable est plus utile dans le terminal que dans le notebook,
oÃ¹ on peut revenir sur une cellule prÃ©cÃ©demment saisie.

Sage inclut un moteur de calcul symbolique. Le nom `x` est une
*variable symbolique* prÃ©dÃ©finie au lancement de Sage.

~~~
sage: a = (x^2 + 2) * (x^3 + 4)
sage: a
(x^3 + 4)*(x^2 + 2)
sage: a.expand()
x^5 + 2*x^3 + 4*x^2 + 8
~~~

On peut dÃ©finir d'autres variables symboliques avec la fonction
`var`. Ses effets sont une entorse aux conventions de bon usage des
langages de programmation, mais Sage met la facilitÃ© d'utilisation en
avant...

~~~
sage: var('y')
y
sage: (x+y)*(x-y)
(x + y)*(x - y)
~~~

Une faÃ§on Ã©quivalente, mais moins magique d'Ã©crire la mÃªme choseÂ :

~~~
sage: y = var('y')
sage: (x+y)*(x-y)
(x + y)*(x - y)
~~~

Mais attentionÂ !

~~~
sage: Z = var('z')
sage: Z + z
2*z
~~~

BeurkÂ ! En programmation il est bon usage de faire une diffÃ©rence
entre `Z` (un *nom de variable*) et sa *valeur* `z` (une *expression
symbolique*).

Beaucoup moins risquÃ©Â : utiliser la mÃ©thode `SR.var` Ã  la place de `var`Â :

~~~
sage: SR.var('t')
t
sage: t
---------------------------------------------------------------------------
NameError                                 Traceback (most recent call last)
...
NameError: name 't' is not defined
~~~

Correct, le nom `t` *ne souille pas l'espace des noms*. MaintenantÂ :

~~~
sage: T = SR.var('t')
sage: T + T
2*t
sage: T + t
---------------------------------------------------------------------------
NameError                                 Traceback (most recent call last)
...
NameError: name 't' is not defined
~~~

Attention Ã  ne pas confondre les *noms de variables* et les *variables
symboliques*, mÃªme lorsqu'elles ont la mÃªme Ã©criture.

~~~
sage: X = SR.var('x')
sage: X
x
sage: x = 6
sage: x
6
sage: X+x
x + 6
~~~

Dans l'exemple ci-dessus, `X` est un *nom de variable* qui pointe vers
une *variable symbolique* reprÃ©sentÃ©e par le caractÃ¨re `x`. Plus bas,
`x` est encore un *nom de variable* qui pointe vers la valeur entiÃ¨re
`6`.


## PolynÃ´mes

Voir le [Sagebook]({{ site.data.bib.sagebook }}), chapitre 7.

En plus des polynÃ´mes symboliques, Sage possÃ¨de plusieurs classes
spÃ©cialisÃ©es de polynÃ´mes Ã  coefficients dans diffÃ©rents anneaux.

La syntaxe la plus simple pour dÃ©finir un anneau de polynÃ´mes (par
exemple sur le corps des rationnels) est

~~~
sage: A.<x> = QQ[]
sage: A
Univariate Polynomial Ring in x over Rational Field
~~~

Cette syntaxe associe le nom `x` au *gÃ©nÃ©rateur* de `A`. Il ne s'agit
plus d'expressions symboliques, tout calcul est maintenant exÃ©cutÃ©
immÃ©diatementÂ :

~~~
sage: (x^2 + 2) * (x^3 + 4)
x^5 + 2*x^3 + 4*x^2 + 8
~~~

La syntaxe utilisÃ©e pour dÃ©finir les polynÃ´mes n'est pas une syntaxe
Python standard. Voici deux autres faÃ§ons de dÃ©finir `A` qui sont
valides en Python.

~~~
sage: A = QQ['x']
sage: x = A.gen()
~~~

~~~
sage: A = PolynomialRing(QQ, 'x')
sage: x = A.gen()
~~~

Dans les deux cas, on voit bien la diffÃ©rence entre le *nom de
variable* `x` et sa *reprÃ©sentation* (aussi `x`). Cela ne doit pas
Ãªtre nÃ©cessairement ainsiÂ :

~~~
sage: A = QQ['x']
sage: toto = A.gen()
sage: toto^2 + 1
x^2 + 1
~~~

### PolynÃ´mes multivariÃ©s

Avec la mÃªme syntaxe, on peut dÃ©finir des anneaux de polynÃ´mes Ã 
plusieurs variablesÂ :

~~~
sage: B.<x,y,z> = RR[]; B
Multivariate Polynomial Ring in x, y, z over Real Field with 53 bits of precision
~~~

L'ordre monomial par dÃ©faut sur les anneaux multivariÃ©s est *degrevlex*Â :

~~~
sage: B.term_order()
Degree reverse lexicographic term order
sage: z < y < x < z^2 < y*z < x*z < y^2 < x*y < x^2
True
~~~

Il est possible de choisir l'ordre au moment de la crÃ©ationÂ :

~~~
sage: C.<x,y,z> = PolynomialRing(QQ, order='lex')
sage: C
Multivariate Polynomial Ring in x, y, z over Rational Field
sage: C.term_order()
Lexicographic term order
sage: z < z^2 < x < x*y < x^2 
True
~~~

Il est aussi possible d'obtenir une copie d'un anneau avec un ordre
diffÃ©rentÂ :

~~~
sage: D = B.change_ring(order='invlex')
sage: D.term_order()
Inverse lexicographic term order
sage: D == B
False
~~~

Sage supporter quelques ordres prÃ©dÃ©finisÂ : `lex`, `invlex`,
`degrevlex`, ... La liste complÃ¨te peut Ãªtre obtenue interactivementÂ :

~~~
sage.rings.polynomial.term_order?
~~~

Il est possible de construire des ordres arbitraires grÃ¢ce Ã  la classe
`TermOrder`. Il est par exemple possible de construire un ordre *avec
poids*Â :

~~~
sage: t = TermOrder('wdegrevlex', (1,2,3)); t
Weighted degree reverse lexicographic term order with weights (1, 2, 3)
sage: E.<x,y,z> = PolynomialRing(QQ, order=t)
sage: x < y < x^2 < z < x*y < x^3 < y^2
True
~~~

Lire la documentation de `TermOrder` pour plus de dÃ©tails.


## Types et conversions


### Parent-Ã©lÃ©ment

Beaucoup de structures algÃ¨briques en Sage sont organisÃ©es autour du
concept de parent-Ã©lÃ©ment.

Par exemple, un anneau de polynÃ´mes est un *parent*, Ã  qui
appartiennent des Ã©lÃ©ments. La majoritÃ© des valeurs en Sage possÃ¨de un
parent, qu'on peut interroger avec la mÃ©thode `parent()`Â :

~~~
sage: 1.parent()
Integer Ring
sage: (1/2).parent()
Rational Field
sage: (0.5).parent()
Real Field with 53 bits of precision
~~~

Attention, beaucoup de noms prÃ©dÃ©finis appartiennent Ã  l'*anneau
symbolique*, mÃªme si l'on pourrait imaginer qu'ils appartiennent Ã  un
parent plus spÃ©cifique (rÃ©els, complexes, ...).

~~~
sage: i.parent()
Symbolic Ring
sage: pi.parent()
Symbolic Ring
sage: x.parent()
Symbolic Ring
~~~

Sage connaÃ®t un bon nombre de *coercitions* automatiques, qui
permettent de faire des opÃ©rations sur des Ã©lÃ©ments de parents
diffÃ©rents.

~~~
sage: A.<x> = QQ[]
sage: x.parent()
Univariate Polynomial Ring in x over Rational Field
sage: 2.parent()
Integer Ring
sage: (2+x).parent()
Univariate Polynomial Ring in x over Rational Field
~~~

Parfois Sage ne sait pas trouver de *coercition canonique*, dans ce
cas il donne une erreurÂ :

~~~
sage: a = GF(7)(2); a
2
sage: a.parent()
Finite Field of size 7
sage: x + a
...
TypeError: unsupported operand parent(s) for '+': 'Univariate Polynomial Ring in
x over Rational Field' and 'Finite Field of size 7'
~~~

Il est possible dans ces cas de *convertir* un Ã©lÃ©ment en l'associant
Ã  un nouveau parent, Sage appliquera alors d'autres rÃ¨gles, dites de
*conversion*, qui ne doivent pas Ãªtre canoniques. Toutes les
conversions prennent la forme de `parent(Ã©lÃ©ment)`.

~~~
sage: x + QQ(a)
x + 2
sage: _.parent()
Univariate Polynomial Ring in x over Rational Field
~~~

Observons cela sur un exemple simple. Il existe un morphisme canonique
de $$â„¤$$ vers $$â„¤/10$$, Sage peut alors additionner deux Ã©lÃ©ments
appartenant Ã  ces deux parents, et le rÃ©sultat sera un Ã©lÃ©ment de
$$â„¤/10$$.

~~~
sage: a = Zmod(10)(2)
sage: a.parent()
Ring of integers modulo 10
sage: 11.parent()
Integer Ring
sage: 11 + a
3
sage: _.parent()
Ring of integers modulo 10
~~~

Le *lift* d'un Ã©lÃ©ment de $$â„¤/10$$ vers $$â„¤$$ n'a rien de canonique,
mais il est tout de mÃªme convenable d'appliquer cette *conversion*
lorsque elle est demandÃ©e par l'utilisateurÂ :

~~~
sage: QQ(a).parent()
Rational Field
sage: 11 + QQ(a)
13
~~~

De faÃ§on similaire, il n'existe pas de morphisme naturel de $$â„š$$ vers
$$â„¤/10$$. Sage donne donc correctement une erreur iciÂ :

~~~
sage: 1/3 + a
...
TypeError: unsupported operand parent(s) for '+': 'Rational Field' and 'Ring of
integers modulo 10'
~~~

Mais, puisque 3 est inversible modulo 10, il est tout de mÃªme possible
de donner un sens Ã  cette conversionÂ :

~~~
sage: Zmod(10)(1/3) + a
9
~~~

### Base

Beaucoup de structures algÃ¨briques en Sage ont une *base*. Par
exemple, les anneaux de polynÃ´mes ont pour base leur anneau de
coefficients.

~~~
sage: A.<x> = GF(7)[]
sage: A.base()
Finite Field of size 7
sage: A.base_ring()
Finite Field of size 7
~~~

Sage considÃ¨re aussi les bases lorsque il cherche Ã  trouver une
*coercition* entre deux Ã©lÃ©ments. Dans cet exemple, `x` est un
polynÃ´me Ã  coefficients dans $$ğ”½_7$$, alors que 10 est un entier.  Au
moment de la coercition, Sage transforme 10 en un Ã©lÃ©ment de $$ğ”½_7$$,
puis le en un Ã©lÃ©ment de $$ğ”½_7[x]$$.

~~~
sage: 10.parent()
Integer Ring
sage: x + 10
x + 3
sage: _.parent()
Univariate Polynomial Ring in x over Finite Field of size 7
~~~

Il est possible d'obtenir une copie d'un anneau avec une base
diffÃ©rente grÃ¢ce Ã  la mÃ©thode `change_ring()`Â :

~~~
sage: B = A.change_ring(QQ); B
Univariate Polynomial Ring in x over Rational Field
sage: B(x)
x
sage: B(x).parent()
Univariate Polynomial Ring in x over Rational Field
sage: x.parent()
Univariate Polynomial Ring in x over Finite Field of size 7
~~~


### Classes, types

Chaque objet mathÃ©matique est reprÃ©sentÃ© par une *classe*
Python. L'opÃ©rateur Python `type` permet d'interroger la classe
d'un objetÂ :

~~~
sage: type(1)
<type 'sage.rings.integer.Integer'>
~~~

Souvent, diffÃ©rentes classes Python rÃ©alisent le mÃªme objet
mathÃ©matique, ce qui permet d'avoir plusieurs implantations pour un
mÃªme objet. Cela est particuliÃ¨rement Ã©vident pour les corps finis, oÃ¹
diffÃ©rents sous-systÃ¨mes sont choisis selon la cardinalitÃ©.

~~~
sage: A.<x> = GF(2)[]
sage: B.<y> = GF(3)[]
sage: C.<z> = GF(3^2,'a')[]
sage: type(x)
<type 'sage.rings.polynomial.polynomial_gf2x.Polynomial_GF2X'>
sage: type(y)
<type 'sage.rings.polynomial.polynomial_zmod_flint.Polynomial_zmod_flint'>
sage: type(z)
<type 'sage.rings.polynomial.polynomial_zz_pex.Polynomial_ZZ_pEX'>
~~~

Voici un autre exemple oÃ¹ deux classes diffÃ©rentes rÃ©alisent le mÃªme
objet mathÃ©matique, mais avec un code diffÃ©rentÂ :

~~~
sage: A = matrix([[1,1],[1,1]])
sage: B = matrix([[1,1],[1,1]], sparse=True)
sage: A == B
True
sage: type(A)
<type 'sage.matrix.matrix_integer_dense.Matrix_integer_dense'>
sage: type(B)
<type 'sage.matrix.matrix_integer_sparse.Matrix_integer_sparse'>
~~~
