---
title: La hyÃ©rarchie des types en Sage
---


## Parents et Ã©lÃ©ments

Beaucoup de structures algÃ¨briques en Sage sont organisÃ©es autour du
concept de parent-Ã©lÃ©ment.

Par exemple, un anneau de polynÃ´mes est un *parent*, Ã  qui
appartiennent des Ã©lÃ©ments. La majoritÃ© des valeurs en Sage possÃ¨de un
parent, qu'on peut interroger avec la mÃ©thode `parent()`Â :

~~~
sage: 1.parent()
Integer Ring
sage: (1/2).parent()
Rational Field
sage: (0.5).parent()
Real Field with 53 bits of precision
~~~

Attention, beaucoup de noms prÃ©dÃ©finis appartiennent Ã  l'*anneau
symbolique*, mÃªme si l'on pourrait imaginer qu'ils appartiennent Ã  un
parent plus spÃ©cifique (rÃ©els, complexes, ...).

~~~
sage: i.parent()
Symbolic Ring
sage: pi.parent()
Symbolic Ring
sage: x.parent()
Symbolic Ring
~~~

Sage connaÃ®t un bon nombre de *coercitions* automatiques, qui
permettent de faire des opÃ©rations sur des Ã©lÃ©ments de parents
diffÃ©rents.

~~~
sage: A.<x> = QQ[]
sage: x.parent()
Univariate Polynomial Ring in x over Rational Field
sage: 2.parent()
Integer Ring
sage: (2+x).parent()
Univariate Polynomial Ring in x over Rational Field
~~~

Parfois Sage ne sait pas trouver de *coercition canonique*, dans ce
cas il donne une erreurÂ :

~~~
sage: a = GF(7)(2); a
2
sage: a.parent()
Finite Field of size 7
sage: x + a
...
TypeError: unsupported operand parent(s) for '+': 'Univariate Polynomial Ring in
x over Rational Field' and 'Finite Field of size 7'
~~~

Il est possible dans ces cas de *convertir* un Ã©lÃ©ment en l'associant
Ã  un nouveau parent, Sage appliquera alors d'autres rÃ¨gles, dites de
*conversion*, qui ne doivent pas Ãªtre canoniques. Toutes les
conversions prennent la forme de `parent(Ã©lÃ©ment)`.

~~~
sage: x + QQ(a)
x + 2
sage: _.parent()
Univariate Polynomial Ring in x over Rational Field
~~~

Observons cela sur un exemple simple. Il existe un morphisme canonique
de $$â„¤$$ vers $$â„¤/10$$, Sage peut alors additionner deux Ã©lÃ©ments
appartenant Ã  ces deux parents, et le rÃ©sultat sera un Ã©lÃ©ment de
$$â„¤/10$$.

~~~
sage: a = Zmod(10)(2)
sage: a.parent()
Ring of integers modulo 10
sage: 11.parent()
Integer Ring
sage: 11 + a
3
sage: _.parent()
Ring of integers modulo 10
~~~

Le *lift* d'un Ã©lÃ©ment de $$â„¤/10$$ vers $$â„¤$$ n'a rien de canonique,
mais il est tout de mÃªme convenable d'appliquer cette *conversion*
lorsque elle est demandÃ©e par l'utilisateurÂ :

~~~
sage: QQ(a).parent()
Rational Field
sage: 11 + QQ(a)
13
~~~

De faÃ§on similaire, il n'existe pas de morphisme naturel de $$â„š$$ vers
$$â„¤/10$$. Sage donne donc correctement une erreur iciÂ :

~~~
sage: 1/3 + a
...
TypeError: unsupported operand parent(s) for '+': 'Rational Field' and 'Ring of
integers modulo 10'
~~~

Mais, puisque 3 est inversible modulo 10, il est tout de mÃªme possible
de donner un sens Ã  cette conversionÂ :

~~~
sage: Zmod(10)(1/3) + a
9
~~~

## Base

Beaucoup de structures algÃ¨briques en Sage ont une *base*. Par
exemple, les anneaux de polynÃ´mes ont pour base leur anneau de
coefficients.

~~~
sage: A.<x> = GF(7)[]
sage: A.base()
Finite Field of size 7
sage: A.base_ring()
Finite Field of size 7
~~~

Sage considÃ¨re aussi les bases lorsque il cherche Ã  trouver une
*coercition* entre deux Ã©lÃ©ments. Dans cet exemple, `x` est un
polynÃ´me Ã  coefficients dans $$ğ”½_7$$, alors que 10 est un entier.  Au
moment de la coercition, Sage transforme 10 en un Ã©lÃ©ment de $$ğ”½_7$$,
puis le en un Ã©lÃ©ment de $$ğ”½_7[x]$$.

~~~
sage: 10.parent()
Integer Ring
sage: x + 10
x + 3
sage: _.parent()
Univariate Polynomial Ring in x over Finite Field of size 7
~~~

Il est possible d'obtenir une copie d'un anneau avec une base
diffÃ©rente grÃ¢ce Ã  la mÃ©thode `change_ring()`Â :

~~~
sage: B = A.change_ring(QQ); B
Univariate Polynomial Ring in x over Rational Field
sage: B(x)
x
sage: B(x).parent()
Univariate Polynomial Ring in x over Rational Field
sage: x.parent()
Univariate Polynomial Ring in x over Finite Field of size 7
~~~


## Classes, types

Chaque objet mathÃ©matique est reprÃ©sentÃ© par une *classe*
Python. L'opÃ©rateur Python `type` permet d'interroger la classe
d'un objetÂ :

~~~
sage: type(1)
<type 'sage.rings.integer.Integer'>
~~~

Souvent, diffÃ©rentes classes Python rÃ©alisent le mÃªme objet
mathÃ©matique, ce qui permet d'avoir plusieurs implantations pour un
mÃªme objet. Cela est particuliÃ¨rement Ã©vident pour les corps finis, oÃ¹
diffÃ©rents sous-systÃ¨mes sont choisis selon la cardinalitÃ©.

~~~
sage: A.<x> = GF(2)[]
sage: B.<y> = GF(3)[]
sage: C.<z> = GF(3^2,'a')[]
sage: type(x)
<type 'sage.rings.polynomial.polynomial_gf2x.Polynomial_GF2X'>
sage: type(y)
<type 'sage.rings.polynomial.polynomial_zmod_flint.Polynomial_zmod_flint'>
sage: type(z)
<type 'sage.rings.polynomial.polynomial_zz_pex.Polynomial_ZZ_pEX'>
~~~

Voici un autre exemple oÃ¹ deux classes diffÃ©rentes rÃ©alisent le mÃªme
objet mathÃ©matique, mais avec un code diffÃ©rentÂ :

~~~
sage: A = matrix([[1,1],[1,1]])
sage: B = matrix([[1,1],[1,1]], sparse=True)
sage: A == B
True
sage: type(A)
<type 'sage.matrix.matrix_integer_dense.Matrix_integer_dense'>
sage: type(B)
<type 'sage.matrix.matrix_integer_sparse.Matrix_integer_sparse'>
~~~
